# GetBeamAngle

## Description
Procedure GetBeamAngle returns the spread angle of the referenced spot light.

```pascal
PROCEDURE GetBeamAngle(
				h              : HANDLE;
				VAR beamAngleR : REAL);
```

```python
def vs.GetBeamAngle(h):
    return beamAngleR
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to light.|
|beamAngleR|REAL|Returns beam spread angle.|

## Version
Availability: from MiniCAD7.0

## Category
* Objects - Lights